
# The Adult Income dataset

### Description

Title of dataset: adult.csv

Sources:

    * Original owners of database - US Census Bureau
    * Donor of database - Ronny Kohavi and Barry Becker
    * Date received - 05/19/96 
    
Number of Instances

    * 48842 instances, mix of continuous and discrete (train=32561, test=16281)
    * 45222 if instances with unknown values are removed (train=30162, test=15060)
    * Split into train-test using MLC++ GenCVFiles (2/3, 1/3 random).

Number of Attributes/Fearures/Columns

    * 6 continuous, 8 nominal attributes. 

Attribute Information/Fearures/Columns

    * age: continuous.
    * workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
    * fnlwgt: continuous.
    * education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
    * education-num: continuous.
    * marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
    * occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
    * relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
    * race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
    * sex: Female, Male.
    * capital-gain: continuous.
    * capital-loss: continuous.
    * hours-per-week: continuous.
    * native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.
    * income: >50K, <=50K 
    
Missing Values:
     
     7% rows have missing values.

In [0]:
# Q1 - Import the required Library (Sample question and answer)

import numpy as np
import pandas as pd

# INSTRUCTIONS

Read the instructions metioned below carefully before attempting the assignment:

    - This assignment has 16 questions and all the questions are mandatory.
    - Read the desciption of the dataset mentioned below carefully.
    - Each question has been commented and written in an independent cell.
    - Write your code in the cell just below the question (Refer Ques-1 - It has been solved for you to understand)
    - Try to submit the assignment within the deadline.
    - Plagiarism will have a huge penality.
    - After completing the assignment upload this notebook to your github and submit the assignment on Google Classroom.
    
    
##### Download the Dataset file(.csv) from here:

https://drive.google.com/file/d/17yZ1NSSsRrDF7qfGOJyGHRDDiBce7EQN/view?usp=sharing

In [0]:
# Q2 - Read the csv file to the pandas dataframe
df=pd.read_csv('adult.csv')

In [0]:
# Q3 - Display the top 5 rows of the dataframe
df.head()

   age  workclass  fnlwgt  ... hours-per-week  native-country income
0   25    Private  226802  ...             40   United-States  <=50K
1   38    Private   89814  ...             50   United-States  <=50K
2   28  Local-gov  336951  ...             40   United-States   >50K
3   44    Private  160323  ...             40   United-States   >50K
4   18          ?  103497  ...             30   United-States  <=50K

[5 rows x 15 columns]

In [0]:
# Q4 - Display the bottom 5 rows of the dataframe

df.tail()

       age     workclass  fnlwgt  ... hours-per-week  native-country income
48837   27       Private  257302  ...             38   United-States  <=50K
48838   40       Private  154374  ...             40   United-States   >50K
48839   58       Private  151910  ...             40   United-States  <=50K
48840   22       Private  201490  ...             20   United-States  <=50K
48841   52  Self-emp-inc  287927  ...             40   United-States   >50K

[5 rows x 15 columns]

In [0]:
# Q5 - How many columns and rows are there in the dataframe?

df.shape

(48842, 15)

In [0]:
# Q6 - Display a breif overview of all the columns data type and missing values?
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  int64
 1   workclass        48842 non-null  object
 2   fnlwgt           48842 non-null  int64
 3   education        48842 non-null  object
 4   educational-num  48842 non-null  int64
 5   marital-status   48842 non-null  object
 6   occupation       48842 non-null  object
 7   relationship     48842 non-null  object
 8   race             48842 non-null  object
 9   gender           48842 non-null  object
 10  capital-gain     48842 non-null  int64
 11  capital-loss     48842 non-null  int64
 12  hours-per-week   48842 non-null  int64
 13  native-country   48842 non-null  object
 14  income           48842 non-null  object
dtypes: int64(6), object(9)
memory usage: 5.6+ MB

In [0]:
# Q7 - Display the descriptive statistical analysis on numerical columns of the dataframe?

df.describe()

                age        fnlwgt  ...  capital-loss  hours-per-week
count  48842.000000  4.884200e+04  ...  48842.000000    48842.000000
mean      38.643585  1.896641e+05  ...     87.502314       40.422382
std       13.710510  1.056040e+05  ...    403.004552       12.391444
min       17.000000  1.228500e+04  ...      0.000000        1.000000
25%       28.000000  1.175505e+05  ...      0.000000       40.000000
50%       37.000000  1.781445e+05  ...      0.000000       40.000000
75%       48.000000  2.376420e+05  ...      0.000000       45.000000
max       90.000000  1.490400e+06  ...   4356.000000       99.000000

[8 rows x 6 columns]

In [0]:
# Q8 - Display the value count on the 'income' column
df.income.value_counts()

<=50K    37155
>50K     11687
Name: income, dtype: int64

In [0]:
# Q9 - Display the percentage of working men and women in the dataframe?

df.gender.value_counts(1)

Male      0.668482
Female    0.331518
Name: gender, dtype: float64

In [0]:
# Q10 - Select hours-per-week from dataframe where gender is female
df.loc[df.gender=='Female',['hours-per-week']]

       hours-per-week
4                  30
8                  40
12                 39
17                 30
18                 20
...               ...
48827              40
48830              40
48837              38
48839              40
48841              40

[16192 rows x 1 columns]

In [0]:
# Q11 - Select hours-per-week from dataframe where gender is male
df.loc[df.gender=='Male',['hours-per-week']]

       hours-per-week
0                  40
1                  50
2                  40
3                  40
5                  30
...               ...
48834              11
48835              40
48836              40
48838              40
48840              20

[32650 rows x 1 columns]

In [0]:
# Q12.1 - Groupby on the gender column and display first()

df_gender=df.groupby('gender')
df_gender.first()

        age workclass  fnlwgt  ... hours-per-week  native-country income
gender                         ...
Female   18         ?  103497  ...             30   United-States  <=50K
Male     25   Private  226802  ...             40   United-States  <=50K

[2 rows x 14 columns]

In [0]:
# Q12.2 - Display the basic statistical analysis of 'hours-per-week' from male and female point

df_race['hours-per-week'].describe()

          count       mean        std  min   25%   50%   75%   max
gender
Female  16192.0  36.400692  11.948866  1.0  30.0  40.0  40.0  99.0
Male    32650.0  42.416845  12.120042  1.0  40.0  40.0  48.0  99.0

In [0]:
# Q13.1 - Groupby on the race column and display first()
df_race=df.groupby('race')
df_race.first()

                    age workclass  ...      native-country income
race                               ...
Amer-Indian-Eskimo   34   Private  ...       United-States  <=50K
Asian-Pac-Islander   40   Private  ...                   ?   >50K
Black                25   Private  ...       United-States  <=50K
Other                46   Private  ...  Dominican-Republic  <=50K
White                38   Private  ...       United-States  <=50K

[5 rows x 14 columns]

In [0]:
# Q13.2 - Display the basic statistical analysis of 'hours-per-week' for different race

df_race['hours-per-week'].describe()

                      count       mean        std  min    25%   50%   75%   max
race
Amer-Indian-Eskimo    470.0  40.272340  11.975022  3.0  40.00  40.0  40.0  96.0
Asian-Pac-Islander   1519.0  39.884793  12.481418  1.0  40.00  40.0  40.0  99.0
Black                4685.0  38.597866  10.345612  1.0  38.00  40.0  40.0  99.0
Other                 406.0  39.201970  10.751450  5.0  35.25  40.0  40.0  98.0
White               41762.0  40.660170  12.598627  1.0  40.00  40.0  45.0  99.0

In [0]:
# Q14 - Display the percentage distribution of gender vs income
# HINT -> Checkout pandas crosstab function
pd.crosstab(df.gender,df.income,normalize='index')

income     <=50K      >50K
gender
Female  0.890749  0.109251
Male    0.696233  0.303767

In [0]:
# Q15 - Display the percentage distribution of marital-status vs income
# HINT -> Checkout pandas crosstab function
pd.crosstab(df['marital-status'],df.income,normalize='index')

income                    <=50K      >50K
marital-status
Divorced               0.898839  0.101161
Married-AF-spouse      0.621622  0.378378
Married-civ-spouse     0.553867  0.446133
Married-spouse-absent  0.907643  0.092357
Never-married          0.954520  0.045480
Separated              0.935294  0.064706
Widowed                0.915679  0.084321

In [0]:
# Q16 - Display the percentage distribution of race vs income
# HINT -> Checkout pandas crosstab function
pd.crosstab(df.race,df.income,normalize='index')

income                 <=50K      >50K
race
Amer-Indian-Eskimo  0.882979  0.117021
Asian-Pac-Islander  0.730744  0.269256
Black               0.879189  0.120811
Other               0.876847  0.123153
White               0.746013  0.253987